## Series

In [2]:
import pandas as pd
import numpy as np

In [3]:
labels = ['a', 'b', 'c']

minha_lista = [10, 20, 30]

arr = np.array([10, 20, 30])

d = {'a':10, 'b':20, 'c':30}

In [4]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [5]:
pd.Series(data=labels, index=minha_lista)

10    a
20    b
30    c
dtype: object

In [6]:
pd.Series(labels, minha_lista)

10    a
20    b
30    c
dtype: object

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
ser1 = pd.Series([1, 2, 3, 4], index = ['EUA', 'Alemanha', 'Rússia', 'Japão'])

In [9]:
ser1

EUA         1
Alemanha    2
Rússia      3
Japão       4
dtype: int64

In [10]:
ser2 = pd.Series([1, 2, 5, 4], index = ['EUA', 'Alemanha', 'Itália', 'Japão'])

In [11]:
ser2

EUA         1
Alemanha    2
Itália      5
Japão       4
dtype: int64

In [12]:
ser1[['EUA', 'Alemanha', 'Rússia']]

EUA         1
Alemanha    2
Rússia      3
dtype: int64

In [13]:
ser1 + ser2

Alemanha    4.0
EUA         2.0
Itália      NaN
Japão       8.0
Rússia      NaN
dtype: float64

## DataFrames

In [14]:
from numpy.random import randn

In [15]:
df = pd.DataFrame(randn(5,4), index= ["A", "B", "C", "D", "E"], columns="W X Y Z".split())

In [16]:
df

          W         X         Y         Z
A  0.873689  2.885529  0.933616 -1.249543
B  0.190282  0.155996  1.580752  0.495412
C -0.639020 -1.791472 -0.138906 -0.584666
D -0.068498  0.986506 -1.935536 -0.135045
E  0.536294 -1.360787 -1.037841 -1.172935

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df[['W']]

          W
A  0.873689
B  0.190282
C -0.639020
D -0.068498
E  0.536294

In [19]:
df['new'] = df['W'] + df['X']

In [20]:
df

          W         X         Y         Z       new
A  0.873689  2.885529  0.933616 -1.249543  3.759218
B  0.190282  0.155996  1.580752  0.495412  0.346278
C -0.639020 -1.791472 -0.138906 -0.584666 -2.430492
D -0.068498  0.986506 -1.935536 -0.135045  0.918008
E  0.536294 -1.360787 -1.037841 -1.172935 -0.824493

In [21]:
df2 = df.drop('new', axis=1)

In [22]:
df

          W         X         Y         Z       new
A  0.873689  2.885529  0.933616 -1.249543  3.759218
B  0.190282  0.155996  1.580752  0.495412  0.346278
C -0.639020 -1.791472 -0.138906 -0.584666 -2.430492
D -0.068498  0.986506 -1.935536 -0.135045  0.918008
E  0.536294 -1.360787 -1.037841 -1.172935 -0.824493

In [23]:
df2

          W         X         Y         Z
A  0.873689  2.885529  0.933616 -1.249543
B  0.190282  0.155996  1.580752  0.495412
C -0.639020 -1.791472 -0.138906 -0.584666
D -0.068498  0.986506 -1.935536 -0.135045
E  0.536294 -1.360787 -1.037841 -1.172935

In [24]:
df.drop('new', axis=1, inplace=True)

In [25]:
df

          W         X         Y         Z
A  0.873689  2.885529  0.933616 -1.249543
B  0.190282  0.155996  1.580752  0.495412
C -0.639020 -1.791472 -0.138906 -0.584666
D -0.068498  0.986506 -1.935536 -0.135045
E  0.536294 -1.360787 -1.037841 -1.172935

In [26]:
df.loc[['A', 'B']]

          W         X         Y         Z
A  0.873689  2.885529  0.933616 -1.249543
B  0.190282  0.155996  1.580752  0.495412

In [27]:
df.loc[['A', 'B']]

          W         X         Y         Z
A  0.873689  2.885529  0.933616 -1.249543
B  0.190282  0.155996  1.580752  0.495412

In [28]:
df

          W         X         Y         Z
A  0.873689  2.885529  0.933616 -1.249543
B  0.190282  0.155996  1.580752  0.495412
C -0.639020 -1.791472 -0.138906 -0.584666
D -0.068498  0.986506 -1.935536 -0.135045
E  0.536294 -1.360787 -1.037841 -1.172935

In [29]:
df.iloc[:-1, 1:4]

          X         Y         Z
A  2.885529  0.933616 -1.249543
B  0.155996  1.580752  0.495412
C -1.791472 -0.138906 -0.584666
D  0.986506 -1.935536 -0.135045

In [30]:
df.iloc[1:3, 2:]

          Y         Z
B  1.580752  0.495412
C -0.138906 -0.584666

In [31]:
df

          W         X         Y         Z
A  0.873689  2.885529  0.933616 -1.249543
B  0.190282  0.155996  1.580752  0.495412
C -0.639020 -1.791472 -0.138906 -0.584666
D -0.068498  0.986506 -1.935536 -0.135045
E  0.536294 -1.360787 -1.037841 -1.172935

In [32]:
df > 0

       W      X      Y      Z
A   True   True   True  False
B   True   True   True   True
C  False  False  False  False
D  False   True  False  False
E   True  False  False  False

In [33]:
df[df > 0]

          W         X         Y         Z
A  0.873689  2.885529  0.933616       NaN
B  0.190282  0.155996  1.580752  0.495412
C       NaN       NaN       NaN       NaN
D       NaN  0.986506       NaN       NaN
E  0.536294       NaN       NaN       NaN

In [34]:
df['Y'] > 0

A     True
B     True
C    False
D    False
E    False
Name: Y, dtype: bool

In [35]:
df[df['Y'] > 0]

          W         X         Y         Z
A  0.873689  2.885529  0.933616 -1.249543
B  0.190282  0.155996  1.580752  0.495412

In [36]:
df[(df['Y'] > 0) & (df['Z'] > 0)]

          W         X         Y         Z
B  0.190282  0.155996  1.580752  0.495412

## Mais detalhes do Índice

In [37]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [38]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [39]:
df

          W         X         Y         Z
A  0.873689  2.885529  0.933616 -1.249543
B  0.190282  0.155996  1.580752  0.495412
C -0.639020 -1.791472 -0.138906 -0.584666
D -0.068498  0.986506 -1.935536 -0.135045
E  0.536294 -1.360787 -1.037841 -1.172935

In [44]:
df.reset_index(inplace=True)

In [45]:
df

   level_0 index         W         X         Y         Z
0        0     A  0.873689  2.885529  0.933616 -1.249543
1        1     B  0.190282  0.155996  1.580752  0.495412
2        2     C -0.639020 -1.791472 -0.138906 -0.584666
3        3     D -0.068498  0.986506 -1.935536 -0.135045
4        4     E  0.536294 -1.360787 -1.037841 -1.172935

In [46]:
df.set_index("index", inplace=True)

In [47]:
df

       level_0         W         X         Y         Z
index
A            0  0.873689  2.885529  0.933616 -1.249543
B            1  0.190282  0.155996  1.580752  0.495412
C            2 -0.639020 -1.791472 -0.138906 -0.584666
D            3 -0.068498  0.986506 -1.935536 -0.135045
E            4  0.536294 -1.360787 -1.037841 -1.172935